#+TITLE: notes
#+ID:       54f3b70d-79a1-4526-9b84-088d970e86c1
#+CUSTOM_ID: notes
#+CATEGORY: notes
#+SETUPFILE: ox.setup
#+FILETAGS: note
****** Exploring Rocks
:PROPERTIES:
:ID:       2a1a1b60-f927-4de6-b90a-69bf03edb62d
:END:
  first step is to clone the repo and take a peak at the examples.

  - clone repo & compile static_lib

  #+begin_src sh :exports code
git clone https://github.com/facebook/rocksdb && cd rocksdb
make static_lib
cd examples/; make all
  #+end_src

  the examples don't output anything to stdout when they're run, but many of them store database files under a directory in =/tmp= which can be inspected. after compiling the library in the root you get a =make_config.mk= which is include'd in =examples/makefile=. worth checking out to get a better understanding of how examples are compiled (with g++).

  let's take a look at the output of options_file_example:

  #+begin_src sh :exports both :eval never-export
cd ./media/01/rocksdb_options_file_example && ls
  #+end_src

  #+results:
  | 000012.log               |
  | CURRENT                  |
  | IDENTITY                 |
  | LOCK                     |
  | LOG                      |
  | LOG.old.1621383828949925 |
  | MANIFEST-000011          |
  | OPTIONS-000009           |
  | OPTIONS-000014           |

  The LOG file looks like this:
  #+begin_example
 7f1c37455ac0 RocksDB version: 6.20.0
 7f1c37455ac0 Git sha a0e0feca6281e6f3c207757a15f6b99d3a67070d
 7f1c37455ac0 Compile date 2021-04-28 12:52:53
 7f1c37455ac0 DB SUMMARY
 7f1c37455ac0 DB Session ID:  73HSPOGLJMAK0WD2FX8D
 7f1c37455ac0 CURRENT file:  CURRENT
 7f1c37455ac0 IDENTITY file:  IDENTITY
 7f1c37455ac0 MANIFEST file:  MANIFEST-000004 size: 110 Bytes
 7f1c37455ac0 SST files in /tmp/rocksdb_options_file_example dir, Total Num: 0, files: 
# ...
  #+end_example

  and the OPTIONS file like this:
  #+begin_example
[Version]
  rocksdb_version=6.20.0
  options_file_version=1.1

[DBOptions]
# ...
  #+end_example

  DB [[https://github.com/facebook/rocksdb/wiki/RocksDB-Options-File][Option Files]] are stored in [[https://en.wikipedia.org/wiki/INI_file][INI]] format. There are a looooot of
  options and a lot of information shown in the LOG. Yikes!
	
